---
kind: enumMember
id: F:Autodesk.Revit.DB.RenderNodeAction.Proceed
enum: Autodesk.Revit.DB.RenderNodeAction
source: html/39f98799-628b-8d65-765c-ca86949ce7ed.htm
---
# Autodesk.Revit.DB.RenderNodeAction.Proceed

Instruct the exporter to go on with processing the node. It means
 the exporter will continue handling the node by processing all its
 child nodes, if it has any, and their geometry where it is relevant.